# SetFillOriginPoint

## Description
Sets the origin point of the fill.

Note: only works with 2D objects that have a gradient or image fill.

```pascal
PROCEDURE SetFillOriginPoint(
				objectHandle : HANDLE;
				xOriginPoint : REAL;
				yOriginPoint : REAL);
```

```python
def vs.SetFillOriginPoint(objectHandle, xOriginPoint, yOriginPoint):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|objectHandle|HANDLE|Handle to the object with fill.|
|xOriginPoint|REAL|X coordinate of origin point.|
|yOriginPoint|REAL|Y coordinate of origin point.|

## Examples
#### VectorScript ####
```pascal
SetFillOriginPoint(objectHandle, 10.0, 20.0);
```
#### Python ####
```python

```

```pascal
SetFillOriginPoint( ObjHand, ImageFillOriginVec.x, ImageFillOriginVec.y );
{
SetFillIAxisEndPoint( ObjHand, ImageFillOriginVec.x + PhotoPrintedWidth, ImageFillOriginVec.y );
SetFillJAxisEndPoint( ObjHand, ImageFillOriginVec.x, ImageFillOriginVec.y + PhotoPrintedHeight );
}

SetFillOriginPoint( ObjHand, ImageFillOriginVec.x, ImageFillOriginVec.y );
SetFillIAxisEndPoint( ObjHand, ImageFillOriginVec.x + ImageFill_IAxisVec.x, ImageFillOriginVec.y + ImageFill_IAxisVec.y );
SetFillJAxisEndPoint( ObjHand, ImageFillOriginVec.x + ImageFill_JAxisVec.x, ImageFillOriginVec.y + ImageFill_JAxisVec.y );
```
```python
vs.SetFillOriginPoint(h, (0, 0), (0, 0))
```

## Version
Availability: from VectorWorks10.0

## Category
* Object Attributes